# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

In [4]:
#create connection
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
#create cursor
cur = conn.cursor()

In [9]:
#crete func to handle looking at query head
def query(sql, head_bool=0): #default for head_bool is 0 (return the full df)
    cur.execute(sql)
    df = pd.DataFrame(cur.fetchall())
    df.columns = [i[0] for i in cur.description]
    if head_bool == 1:
        return df.head() #return only the head if specified
    else:
        return df #default return value

## Display the names of all the employees in Boston.

In [10]:
#first look at head of table
query("""SELECT * FROM employees;""", 1)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)

In [11]:
#get all emp names
query("""SELECT firstName, lastName FROM employees;""")

   firstName   lastName
0      Diane     Murphy
1       Mary  Patterson
2       Jeff   Firrelli
3    William  Patterson
4     Gerard     Bondur
5    Anthony        Bow
6     Leslie   Jennings
7     Leslie   Thompson
8      Julie   Firrelli
9      Steve  Patterson
10  Foon Yue      Tseng
11    George     Vanauf
12      Loui     Bondur
13    Gerard  Hernandez
14    Pamela   Castillo
15     Larry       Bott
16     Barry      Jones
17      Andy     Fixter
18     Peter      Marsh
19       Tom       King
20      Mami      Nishi
21   Yoshimi       Kato
22    Martin     Gerard

## Do any offices have no employees?

In [13]:
#Your code here
query("""SELECT o.officeCode, count(e.employeeNumber) as num_employees FROM offices o
left join employees e
on o.officeCode = e.officeCode
group by o.officeCode
order by count(e.employeeNumber) ASC""")
#statement counts the number of employees in each office and sorts them by number of employees displying
#the office with the least number of employees first

  officeCode  num_employees
0          2              2
1          3              2
2          5              2
3          7              2
4          6              4
5          4              5
6          1              6

#### No, every office has at least 2 employees

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [20]:
# what product line has had the most orders of all time?
query("""select prod.productLine, count(ordtl.orderNumber) as num_orders from products prod
left join orderdetails ordtl on prod.productCode = ordtl.productCode
group by prod.productLine
order by count(ordtl.orderNumber) DESC
limit 1;""")

    productLine  num_orders
0  Classic Cars        1010

In [30]:
# What are the top 3 products sold by total price in the top 5 cities by number of customers?
query("""SELECT prod.productName, sum(ordtl.priceEach*ordtl.quantityOrdered) as total_revenue from products prod
left join orderdetails ordtl on prod.productCode = ordtl.productCode
left join orders ord on ordtl.orderNumber = ord.orderNumber
left join customers cust on ord.customerNumber = cust.customerNumber
where cust.city in (Select city as num_customers from customers
group by city
order by count(customerNumber) DESC
limit 5)
group by prod.productName
order by sum(ordtl.priceEach*ordtl.quantityOrdered) DESC
limit 3;""")

                      productName  total_revenue
0     1992 Ferrari 360 Spider red       84438.49
1  1998 Chrysler Plymouth Prowler       62095.58
2               2001 Ferrari Enzo       57481.32

In [31]:
# What offices are driving the top 2 products in the product line with the most orders last year?
query("""select off.city from offices off
left join employees emp on off.officeCode = emp.officeCode
left join customers cust on emp.employeeNumber = cust.salesRepEmployeeNumber
left join order ord on cust.customerNumber = ord.customerNumber
left join orderDetails ordtl on ord.orderNumber = ordtl.orderNumber
left join products prod on ordtl.productNumber = prod.productNumber;""")

OperationalError: near "order": syntax error

In [ ]:
# What are the 3 least profitable products (eachPrice - buyPrice) and who is the employee that sells the most of each?

In [ ]:
# what manager is seeing the slowest time between orderdate and paymentDate? 
# ie. which manager is collecting on our accounts reveivable the fastest?

In [ ]:
# what is the average delay between orderDate and shipppedDate for each country?

In [ ]:
# for which productvendors are we selling our products above MSRP?
# what is the median value for those above msrp?

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!